ws_app/app/controllers/accounts_controller.rb

  def create
    @account = BolideApi::Account.load_with(params[:account])
    if @account.save
---
INSERT INTO `accounts` (`created_at`, `updated_at`, `api_key`, `id`) VALUES('2010-01-26 03:15:02', '2010-01-26 03:15:02', '1', 'test1')